uhnp/src/Enums/СтатусыЛотов/СтатусыЛотов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЛотов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>ЗапросЦенУПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ВключенВГПЗ</name>
  </enumValues>
  <enumValues>
    <name>ПубликацияЗаявки</name>
  </enumValues>
  <enumValues>
    <name>ОбъявленаЗакупка</name>
  </enumValues>
  <enumValues>
    <name>КвалификационныйОтбор</name>
  </enumValues>
  <enumValues>
    <name>СборПредложенийПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ВыборПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПоставщикВыбран</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОтменой</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыЛотов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Получить для указанного статуса список доступных для перехода статусов.
// Если статус не указан, то возвращает весь список лотов.
// Если указан статус закрытого лота, то возвращает только его.
Функция ПолучитьДоступныеСтатусы(НачальныйСтатус) Экспорт
	
	Если ЭтоСтатусЗакрытогоЛота(НачальныйСтатус) Тогда
		мСтатусы = Новый Массив;
		мСтатусы.Добавить(НачальныйСтатус);
		Возврат мСтатусы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЛотов.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.СтатусыЛотов КАК СтатусыЛотов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.СтатусыЛотов КАК ПорядокИсходногоСтатуса
		|		ПО (ПорядокИсходногоСтатуса.Ссылка = &НачальныйСтатус)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &НачальныйСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыЛотов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СтатусыЛотов.Порядок >= ПорядокИсходногоСтатуса.Порядок
		|		КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачальныйСтатус", НачальныйСтатус);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗСтатусов = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗСтатусов.ВыгрузитьКолонку(0);
КонецФункции

Функция ПолучитьСтатусыЗакрытыхЛотов() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Закрыт);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗакрытСОтменой);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаДоВключенияВГПЗ() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Черновик);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.НаУтверждении);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗапросЦенУПоставщиков);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаДляСогласования() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПустаяСсылка());
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Черновик);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.НаУтверждении);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВключенВГПЗ);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаВПроцессеПубликации() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗапросЦенУПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПубликацияЗаявки);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ОбъявленаЗакупка);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.СборПредложенийПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаДляПрограммыЗакупок() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВключенВГПЗ);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПубликацияЗаявки);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ОбъявленаЗакупка);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.СборПредложенийПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Закрыт);
	// Нет статуса "ЗакрытСОтменой"
	
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаМожноОтправитьНаЭТП() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗапросЦенУПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВключенВГПЗ);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПубликацияЗаявки);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ОбъявленаЗакупка);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.СборПредложенийПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗакрытСОтменой);
	
	Возврат мСтатусыЛотов;
КонецФункции
			
Функция ПолучитьСтатусыЛотовСВыбраннымиПоставщиками() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотовПослеНачалаВыбораПоставщика() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Закрыт);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗакрытСОтменой);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотовПослеПубликации() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ОбъявленаЗакупка);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.СборПредложенийПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Закрыт);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗакрытСОтменой);
	Возврат мСтатусыЛотов;
КонецФункции

Функция ПолучитьСтатусыЛотаДляПоставщика() Экспорт
	мСтатусыЛотов = Новый Массив;
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ЗапросЦенУПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВключенВГПЗ);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПубликацияЗаявки);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ОбъявленаЗакупка);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.СборПредложенийПоставщиков);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ВыборПоставщика);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.ПоставщикВыбран);
	мСтатусыЛотов.Добавить(Перечисления.СтатусыЛотов.Закрыт);
	
	Возврат мСтатусыЛотов;
КонецФункции

Функция ЭтоСтатусЛотаПослеПубликации(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотовПослеПубликации().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

Функция ЭтоСтатусЛотаПослеНачалаВыбораПоставщика(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотовПослеНачалаВыбораПоставщика().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

Функция ЭтоСтатусЗакрытогоЛота(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЗакрытыхЛотов().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

Функция ЭтоСтатусЛотаДоВключенияВГПЗ(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотаДоВключенияВГПЗ().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

Функция ЭтоСтатусЛотаДляПроцессаСогласования(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотаДляСогласования().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

Функция ЭтоСтатусЛотаВключенногоВГПЗ(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотаДоВключенияВГПЗ().Найти(СтатусДляПроверки) = Неопределено;
КонецФункции

Функция ЭтоСтатусЛотаВПроцессеПубликации(СтатусДляПроверки) Экспорт
	Возврат ПолучитьСтатусыЛотаВПроцессеПубликации().Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции


#КонецЕсли
